-- phpMyAdmin SQL Dump
-- version 5.2.0
-- https://www.phpmyadmin.net/
--
-- Host: localhost
-- Generation Time: Feb 02, 2023 at 02:58 PM
-- Server version: 10.4.27-MariaDB
-- PHP Version: 8.1.12

SET SQL_MODE = "NO_AUTO_VALUE_ON_ZERO";
START TRANSACTION;
SET time_zone = "+00:00";


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8mb4 */;

--
-- Database: `yama`
--

-- --------------------------------------------------------

--
-- Table structure for table `mountain`
--

CREATE TABLE `mountain` (
  `id` int(11) NOT NULL,
  `username` varchar(30) NOT NULL,
  `mountain_id` varchar(10) NOT NULL,
  `mont` varchar(30) NOT NULL,
  `nameKana` varchar(30) NOT NULL,
  `area` varchar(30) NOT NULL,
  `prefectures` varchar(30) NOT NULL,
  `latitude` varchar(200) NOT NULL,
  `longitude` varchar(200) NOT NULL,
  `happy` varchar(900) DEFAULT NULL,
  `checkbox` varchar(6) DEFAULT NULL,
  `created_at` datetime NOT NULL,
  `updated_at` datetime NOT NULL,
  `deleted_at` datetime DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_bin;

--
-- Dumping data for table `mountain`
--

INSERT INTO `mountain` (`id`, `username`, `mountain_id`, `mont`, `nameKana`, `area`, `prefectures`, `latitude`, `longitude`, `happy`, `checkbox`, `created_at`, `updated_at`, `deleted_at`) VALUES
(1, 'testuser01', '0', '八甲田山<大岳>', 'はっこうださん<おおだけ>', '奥羽山脈北部（八甲田山とその周辺）', '青森県', '41', '141', '', '', '2023-01-12 22:18:10', '2023-01-12 22:18:10', '2023-02-02 01:54:41'),
(2, 'testuser01', '156', '八甲田山<大岳>', 'はっこうださん<おおだけ>', '奥羽山脈北部（八甲田山とその周辺）', '青森県', '41', '141', '', '', '2023-01-14 01:51:05', '2023-01-14 01:51:05', '2023-02-02 01:42:03'),
(3, 'testuser01', '176', '白神岳', 'しらかみだけ', '白神山地', '青森県', '40.5075', '140.01833333333335', '', '', '2023-01-14 02:28:29', '2023-01-14 02:28:29', NULL),
(4, 'testuser01', '5', '羅臼岳', 'らうすだけ', '知床・阿寒', '北海道', '44.075833333333335', '145.12222222222223', 'いつか、登ってみたい!!\r\n', '', '2023-01-14 02:33:49', '2023-01-14 03:43:31', NULL),
(5, 'testuser01', '156', '八甲田山<大岳', 'はっこうださん<おおだけ', '奥羽山脈北部（八甲田山とその周辺）', '青森県', '40.65888888888889', '140.87722222222223', '', '', '2023-01-14 02:34:09', '2023-01-14 02:34:09', NULL),
(6, 'testuser01', '953', '英彦山', 'ひこさん', '筑紫山地', '大分県,福岡県', '33.476111111111116', '130.9261111111111', '', '', '2023-01-14 02:34:33', '2023-01-14 02:34:33', NULL),
(7, 'testuser02', '364', '白石山', 'はくせきさん', '関東山地', '埼玉県', '35.89944444444444', '138.87805555555556', '行きたい！！', '', '2023-01-14 02:47:48', '2023-01-14 03:28:28', NULL),
(8, 'testuser02', '176', '白神岳', 'しらかみだけ', '白神山地', '青森県', '40.5075', '140.01833333333335', NULL, NULL, '2023-01-14 04:34:51', '2023-01-14 04:34:51', '2023-02-02 01:56:11'),
(9, 'testuser02', '5', '羅臼岳', 'らうすだけ', '知床・阿寒', '北海道', '44.075833333333335', '145.12222222222223', 'どっか行きたいなーーー', NULL, '2023-01-14 13:03:58', '2023-01-14 13:35:55', NULL),
(10, 'testuser02', '973', '阿蘇山<高岳', 'あそさん<たかだけ', '阿蘇・くじゅうとその周辺', '熊本県', '32.88444444444444', '131.1038888888889', 'いつもいってる山で、好きです', NULL, '2023-01-14 13:35:19', '2023-01-14 13:35:39', '2023-01-14 13:36:02'),
(11, 'testuser03', '14', '雌阿寒岳', 'めあかんだけ', '知床・阿寒', '北海道', '43.38638888888889', '144.00861111111112', 'いい山です！', NULL, '2023-01-14 13:36:59', '2023-01-14 17:52:40', NULL),
(12, 'testuser04', '319', '苗場山', 'なえばさん', '苗場山・白根山・浅間山', '新潟県,長野県', '36.84583333333334', '138.6902777777778', NULL, NULL, '2023-01-14 14:31:40', '2023-01-14 14:31:40', '2023-01-14 14:32:20'),
(13, 'testuser03', '335', '浅間山', 'あさまやま', '苗場山・白根山・浅間山', '群馬県,長野県', '36.406666666666666', '138.52305555555557', '真田丸見たいなー', NULL, '2023-01-14 14:31:52', '2023-01-14 14:32:12', NULL),
(14, 'testuser04', '1004', '祖母山', 'そぼさん', '九州山地', '大分県,宮崎県', '32.82805555555556', '131.34694444444446', 'ここはいいやまだ！！', NULL, '2023-01-14 14:33:24', '2023-01-14 17:28:00', NULL),
(15, 'testuser02', '5', '羅臼岳', 'らうすだけ', '知床・阿寒', '北海道', '44.075833333333335', '145.12222222222223', NULL, NULL, '2023-01-14 17:22:36', '2023-01-14 17:22:36', NULL),
(16, '', '274', '白根山', 'しらねさん', '那須・日光', '栃木県,群馬県', '36.79861111111111', '139.37583333333333', NULL, NULL, '2023-01-14 17:27:40', '2023-01-14 17:27:40', NULL),
(17, 'testuser03', '28', '天塩岳', 'てしおだけ', '北見山地', '北海道', '43.964444444444446', '142.88805555555555', NULL, NULL, '2023-01-14 17:29:11', '2023-01-14 17:29:11', NULL),
(18, 'testuser03', '18', '利尻山（利尻富士）', 'りしりざん（りしりふじ）', '礼文・利尻', '北海道', '45.17861111111111', '141.24194444444444', NULL, NULL, '2023-01-14 17:48:19', '2023-01-14 17:48:19', NULL),
(19, 'testuser03', '196', '栗駒山', 'くりこまやま', '奥羽山脈中部', '宮城県,岩手県', '38.96083333333333', '140.78833333333333', '宮城へ行くなら、盛岡も行きたいなー', NULL, '2023-01-14 17:53:13', '2023-01-14 17:53:36', NULL),
(20, 'testuser03', '397', '愛鷹山<越前岳', 'あしたかやま<えちぜんだけ', '富士山とその周辺', '静岡県', '35.238055555555555', '138.7938888888889', NULL, NULL, '2023-02-02 01:57:06', '2023-02-02 01:57:06', NULL),
(21, 'testuser02', '146', '早池峰山', 'はやちねさん', '北上高地', '岩手県', '39.558611111111105', '141.4886111111111', NULL, NULL, '2023-02-02 01:58:01', '2023-02-02 01:58:01', NULL),
(22, 'testuser02', '1027', '御岳（北岳）', 'おんたけ（きただけ）', '九州南部（桜島）', '鹿児島県', '31.592499999999998', '130.65666666666667', '行ってみたいな〜〜', NULL, '2023-02-02 01:58:49', '2023-02-02 01:59:08', '2023-02-02 21:21:38'),
(23, 'testuser02', '208', '船形山（御所山）', 'ふながたやま（ごしょざん）', '奥羽山脈南部', '宮城県,山形県', '38.455555555555556', '140.62', NULL, NULL, '2023-02-02 21:20:47', '2023-02-02 21:20:47', NULL),
(24, 'testuser02', '846', '三瓶山<男三瓶山', 'さんべさん<おさんべさん', '中国山地中部', '島根県', '35.14055555555556', '132.62166666666667', 'ついでに出雲大社に行きたい！', NULL, '2023-02-02 21:21:07', '2023-02-02 21:21:32', NULL),
(25, 'lee', '176', '白神岳', 'しらかみだけ', '白神山地', '青森県', '40.5075', '140.01833333333335', 'これは行きたいわ！！！！！', NULL, '2023-02-02 21:47:14', '2023-02-02 21:47:22', NULL),
(26, 'lee', '953', '英彦山', 'ひこさん', '筑紫山地', '大分県,福岡県', '33.476111111111116', '130.9261111111111', '修繕工事が終わったら、また行きたいなーー楽しみにしています！', NULL, '2023-02-02 21:47:40', '2023-02-02 21:48:01', NULL),
(27, 'testuser03', '176', '白神岳', 'しらかみだけ', '白神山地', '青森県', '40.5075', '140.01833333333335', NULL, NULL, '2023-02-02 22:51:21', '2023-02-02 22:51:21', NULL);

--
-- Indexes for dumped tables
--

--
-- Indexes for table `mountain`
--
ALTER TABLE `mountain`
  ADD PRIMARY KEY (`id`);

--
-- AUTO_INCREMENT for dumped tables
--

--
-- AUTO_INCREMENT for table `mountain`
--
ALTER TABLE `mountain`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=28;
COMMIT;

/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
